In [2]:
import pandas as pd

dict = {
    "country": ["india", "maharashtra"],
    "price": [1234, 3456]
}

b = pd.DataFrame(dict)
b

       country  price
0        india   1234
1  maharashtra   3456

In [3]:
s = b.drop('country',axis=1)
b

       country  price
0        india   1234
1  maharashtra   3456

In [4]:
data = pd.read_csv('/home/safwan/Documents/projects/python/Data Analysis/pandas/data/Sample100.csv')
data

,Serial Number,Company Name,Employee Markme,Description,Leave
0,9788189999599,TALES OF SHIVA,Mark,mark,0
1,9780099578079,1Q84 THE COMPLETE TRILOGY,HARUKI MURAKAMI,Mark,0
2,9780198082897,MY KUMAN,Mark,Mark,0
3,9780007880331,THE GOD OF SMAAL THINGS,ARUNDHATI ROY,4TH HARPER COLLINS,2
4,9780545060455,THE BLACK CIRCLE,Mark,4TH HARPER COLLINS,0
...,...,...,...,...,...
94,9788184821536,MORE STORIES FROM THE JATAKAS,Mark,ACK,0
95,9788184821543,MORE TALES OF BIRBAL,-,ACK,0
96,9788184821550,TALES FROM THE JATAKAS,-,ACK,0
97,9788184821567,RAMarkS OF MEWAR,-,ACK,0
98,9788184821574,THE SONS OF THE PANDAVAS,-,ACK,0

In [5]:
# Indexing

# Pandas Series
data['Serial Number']

0     9788189999599
1     9780099578079
2     9780198082897
3     9780007880331
4     9780545060455
          ...
94    9788184821536
95    9788184821543
96    9788184821550
97    9788184821567
98    9788184821574
Name: Serial Number, Length: 99, dtype: int64

In [7]:
# Pandas DataFrame
data[['Serial Number']]

    Serial Number
0   9788189999599
1   9780099578079
2   9780198082897
3   9780007880331
4   9780545060455
..            ...
94  9788184821536
95  9788184821543
96  9788184821550
97  9788184821567
98  9788184821574

[99 rows x 1 columns]

In [8]:
# access rows
data[0:3]

,Serial Number,Company Name,Employee Markme,Description,Leave
0,9788189999599,TALES OF SHIVA,Mark,mark,0
1,9780099578079,1Q84 THE COMPLETE TRILOGY,HARUKI MURAKAMI,Mark,0
2,9780198082897,MY KUMAN,Mark,Mark,0

In [10]:
data.iloc[2]

Serial Number      9780198082897
Company Name            MY KUMAN
Employee Markme             Mark
Description                 Mark
Leave                          0
Name: 2, dtype: object

In [11]:
b.index = ["A", "B"]
b.loc[['A', 'B']]

       country  price
A        india   1234
B  maharashtra   3456

In [12]:
data.columns

Index(['Serial Number', 'Company Name', 'Employee Markme', 'Description',
       'Leave'],
      dtype='object')

In [14]:
data.rename(columns = {'Serial Number': 'SN'}, inplace=True)
data

,SN,Company Name,Employee Markme,Description,Leave
0,9788189999599,TALES OF SHIVA,Mark,mark,0
1,9780099578079,1Q84 THE COMPLETE TRILOGY,HARUKI MURAKAMI,Mark,0
2,9780198082897,MY KUMAN,Mark,Mark,0
3,9780007880331,THE GOD OF SMAAL THINGS,ARUNDHATI ROY,4TH HARPER COLLINS,2
4,9780545060455,THE BLACK CIRCLE,Mark,4TH HARPER COLLINS,0
...,...,...,...,...,...
94,9788184821536,MORE STORIES FROM THE JATAKAS,Mark,ACK,0
95,9788184821543,MORE TALES OF BIRBAL,-,ACK,0
96,9788184821550,TALES FROM THE JATAKAS,-,ACK,0
97,9788184821567,RAMarkS OF MEWAR,-,ACK,0
98,9788184821574,THE SONS OF THE PANDAVAS,-,ACK,0

In [15]:
data.isnull().sum()

SN                 0
Company Name       0
Employee Markme    2
Description        0
Leave              0
dtype: int64

In [19]:
data = data.dropna(how='any', axis=0)
data.isnull().sum()

SN                 0
Company Name       0
Employee Markme    0
Description        0
Leave              0
dtype: int64

In [20]:
data = data.drop(data.head(0).index)
data

,SN,Company Name,Employee Markme,Description,Leave
0,9788189999599,TALES OF SHIVA,Mark,mark,0
1,9780099578079,1Q84 THE COMPLETE TRILOGY,HARUKI MURAKAMI,Mark,0
2,9780198082897,MY KUMAN,Mark,Mark,0
3,9780007880331,THE GOD OF SMAAL THINGS,ARUNDHATI ROY,4TH HARPER COLLINS,2
4,9780545060455,THE BLACK CIRCLE,Mark,4TH HARPER COLLINS,0
...,...,...,...,...,...
94,9788184821536,MORE STORIES FROM THE JATAKAS,Mark,ACK,0
95,9788184821543,MORE TALES OF BIRBAL,-,ACK,0
96,9788184821550,TALES FROM THE JATAKAS,-,ACK,0
97,9788184821567,RAMarkS OF MEWAR,-,ACK,0
98,9788184821574,THE SONS OF THE PANDAVAS,-,ACK,0

In [21]:
data.head

<bound method NDFrame.head of                SN                   Company Name  Employee Markme  \
0   9788189999599                 TALES OF SHIVA             Mark
1   9780099578079      1Q84 THE COMPLETE TRILOGY  HARUKI MURAKAMI
2   9780198082897                       MY KUMAN             Mark
3   9780007880331        THE GOD OF SMAAL THINGS    ARUNDHATI ROY
4   9780545060455               THE BLACK CIRCLE             Mark
..            ...                            ...              ...
94  9788184821536  MORE STORIES FROM THE JATAKAS             Mark
95  9788184821543           MORE TALES OF BIRBAL                -
96  9788184821550         TALES FROM THE JATAKAS                -
97  9788184821567               RAMarkS OF MEWAR                -
98  9788184821574       THE SONS OF THE PANDAVAS                -

           Description  Leave
0                 mark      0
1                 Mark      0
2                 Mark      0
3   4TH HARPER COLLINS      2
4   4TH HARPER COLLINS      0
..                 ...    ...
94                 ACK      0
95                 ACK      0
96                 ACK      0
97                 ACK      0
98                 ACK      0

[97 rows x 5 columns]>

In [22]:
data = data.drop(data.index[[0]])
data.head

<bound method NDFrame.head of                SN                   Company Name  Employee Markme  \
1   9780099578079      1Q84 THE COMPLETE TRILOGY  HARUKI MURAKAMI
2   9780198082897                       MY KUMAN             Mark
3   9780007880331        THE GOD OF SMAAL THINGS    ARUNDHATI ROY
4   9780545060455               THE BLACK CIRCLE             Mark
5   9788126525072  THE THREE LAWS OF PERFORMANCE             Mark
..            ...                            ...              ...
94  9788184821536  MORE STORIES FROM THE JATAKAS             Mark
95  9788184821543           MORE TALES OF BIRBAL                -
96  9788184821550         TALES FROM THE JATAKAS                -
97  9788184821567               RAMarkS OF MEWAR                -
98  9788184821574       THE SONS OF THE PANDAVAS                -

           Description  Leave
1                 Mark      0
2                 Mark      0
3   4TH HARPER COLLINS      2
4   4TH HARPER COLLINS      0
5   4TH HARPER COLLINS      0
..                 ...    ...
94                 ACK      0
95                 ACK      0
96                 ACK      0
97                 ACK      0
98                 ACK      0

[96 rows x 5 columns]>

In [23]:
data['Employee Markme'] = data['Employee Markme'].replace(['Mark'], 'M')
data.head

<bound method NDFrame.head of                SN                   Company Name  Employee Markme  \
1   9780099578079      1Q84 THE COMPLETE TRILOGY  HARUKI MURAKAMI
2   9780198082897                       MY KUMAN                M
3   9780007880331        THE GOD OF SMAAL THINGS    ARUNDHATI ROY
4   9780545060455               THE BLACK CIRCLE                M
5   9788126525072  THE THREE LAWS OF PERFORMANCE                M
..            ...                            ...              ...
94  9788184821536  MORE STORIES FROM THE JATAKAS                M
95  9788184821543           MORE TALES OF BIRBAL                -
96  9788184821550         TALES FROM THE JATAKAS                -
97  9788184821567               RAMarkS OF MEWAR                -
98  9788184821574       THE SONS OF THE PANDAVAS                -

           Description  Leave
1                 Mark      0
2                 Mark      0
3   4TH HARPER COLLINS      2
4   4TH HARPER COLLINS      0
5   4TH HARPER COLLINS      0
..                 ...    ...
94                 ACK      0
95                 ACK      0
96                 ACK      0
97                 ACK      0
98                 ACK      0

[96 rows x 5 columns]>

In [24]:
# data.filna('0', isplace=True)
# fill o into null value